Revit 2015 API
BoundarySegment.Curve Property
Get the curve that is formed by the element that defines the edge of this area.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public Curve Curve { get; }
Visual Basic
Public ReadOnly Property Curve As Curve
	Get
Visual C++
public:
property Curve^ Curve {
	Curve^ get ();
}
See Also
BoundarySegment Class
Autodesk.Revit.DB.Mechanical Namespace